PayPalAPISoapBinding.UpdateRecurringPaymentsProfile.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:UpdateRecurringPaymentsProfileReq>
    <ns1:UpdateRecurringPaymentsProfileRequest>
     <ns3:UpdateRecurringPaymentsProfileRequestDetails>
      <ns3:ProfileID></ns3:ProfileID>
      <ns3:Note></ns3:Note>
      <ns3:Description></ns3:Description>
      <ns3:SubscriberName></ns3:SubscriberName>
      <ns3:SubscriberShippingAddress>
       <ns3:Name></ns3:Name>
       <ns3:Street1></ns3:Street1>
       <ns3:Street2></ns3:Street2>
       <ns3:CityName></ns3:CityName>
       <ns3:StateOrProvince></ns3:StateOrProvince>
       <ns3:Country>AF</ns3:Country>
       <ns3:CountryName></ns3:CountryName>
       <ns3:Phone></ns3:Phone>
       <ns3:PostalCode></ns3:PostalCode>
       <ns3:AddressID></ns3:AddressID>
       <ns3:AddressOwner>PayPal</ns3:AddressOwner>
       <ns3:ExternalAddressID></ns3:ExternalAddressID>
       <ns3:InternationalName></ns3:InternationalName>
       <ns3:InternationalStateAndCity></ns3:InternationalStateAndCity>
       <ns3:InternationalStreet></ns3:InternationalStreet>
       <ns3:AddressStatus>None</ns3:AddressStatus>
       <ns3:AddressNormalizationStatus>None</ns3:AddressNormalizationStatus>
      </ns3:SubscriberShippingAddress>
      <ns3:ProfileReference></ns3:ProfileReference>
      <ns3:AdditionalBillingCycles>0</ns3:AdditionalBillingCycles>
      <ns3:Amount currencyID="AFA"></ns3:Amount>
      <ns3:ShippingAmount currencyID="AFA"></ns3:ShippingAmount>
      <ns3:TaxAmount currencyID="AFA"></ns3:TaxAmount>
      <ns3:OutstandingBalance currencyID="AFA"></ns3:OutstandingBalance>
      <ns3:AutoBillOutstandingAmount>NoAutoBill</ns3:AutoBillOutstandingAmount>
      <ns3:MaxFailedPayments>0</ns3:MaxFailedPayments>
      <ns3:CreditCard>
       <ns3:CreditCardType>Visa</ns3:CreditCardType>
       <ns3:CreditCardNumber></ns3:CreditCardNumber>
       <ns3:ExpMonth>0</ns3:ExpMonth>
       <ns3:ExpYear>0</ns3:ExpYear>
       <ns3:CardOwner>
       </ns3:CardOwner>
       <ns3:CVV2></ns3:CVV2>
       <ns3:StartMonth>0</ns3:StartMonth>
       <ns3:StartYear>0</ns3:StartYear>
       <ns3:IssueNumber></ns3:IssueNumber>
       <ns3:ThreeDSecureRequest>
       </ns3:ThreeDSecureRequest>
      </ns3:CreditCard>
      <ns3:BillingStartDate>2017-10-31T23:05:28Z</ns3:BillingStartDate>
      <ns3:TrialPeriod>
       <ns3:BillingPeriod>NoBillingPeriodType</ns3:BillingPeriod>
       <ns3:BillingFrequency>0</ns3:BillingFrequency>
       <ns3:TotalBillingCycles>0</ns3:TotalBillingCycles>
       <ns3:Amount currencyID="AFA"></ns3:Amount>
       <ns3:ShippingAmount currencyID="AFA"></ns3:ShippingAmount>
       <ns3:TaxAmount currencyID="AFA"></ns3:TaxAmount>
      </ns3:TrialPeriod>
      <ns3:PaymentPeriod>
       <ns3:BillingPeriod>NoBillingPeriodType</ns3:BillingPeriod>
       <ns3:BillingFrequency>0</ns3:BillingFrequency>
       <ns3:TotalBillingCycles>0</ns3:TotalBillingCycles>
       <ns3:Amount currencyID="AFA"></ns3:Amount>
       <ns3:ShippingAmount currencyID="AFA"></ns3:ShippingAmount>
       <ns3:TaxAmount currencyID="AFA"></ns3:TaxAmount>
      </ns3:PaymentPeriod>
     </ns3:UpdateRecurringPaymentsProfileRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:UpdateRecurringPaymentsProfileRequest>
   </ns1:UpdateRecurringPaymentsProfileReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
